GHB2/src/InformationRegisters/гхб_ОтветственныеЗаПожарнуюБезопасность/гхб_ОтветственныеЗаПожарнуюБезопасность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_ОтветственныеЗаПожарнуюБезопасность</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Закрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтветственныйЗаПожарнуюБезопасность</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_ОтветственныеЗаПожарнуюБезопасность/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВернутьАктуальныхСотрудниковДляПомещения(_Помещение) Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	гхб_ОтветственныеЗаПожарнуюБезопасностьСрезПоследних.ОтветственныйЗаПожарнуюБезопасность КАК ОтветственныйЗаПожарнуюБезопасность
	               |ИЗ
	               |	РегистрСведений.гхб_ОтветственныеЗаПожарнуюБезопасность.СрезПоследних(, Помещение = &Помещение) КАК гхб_ОтветственныеЗаПожарнуюБезопасностьСрезПоследних
	               |ГДЕ
	               |	НЕ гхб_ОтветственныеЗаПожарнуюБезопасностьСрезПоследних.Закрыть";
	
	Запрос.УстановитьПараметр("Помещение", _Помещение);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ОтветственныйЗаПожарнуюБезопасность");
	
КонецФункции

Функция ВернутьАктуальныеПомещенияДляСотрудника(_Сотрудник) Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	гхб_ОтветственныеЗаПожарнуюБезопасностьСрезПоследних.Помещение КАК Помещение
	               |ИЗ
	               |	РегистрСведений.гхб_ОтветственныеЗаПожарнуюБезопасность.СрезПоследних(, ОтветственныйЗаПожарнуюБезопасность = &ОтветственныйЗаПожарнуюБезопасность) КАК гхб_ОтветственныеЗаПожарнуюБезопасностьСрезПоследних
	               |ГДЕ
	               |	НЕ гхб_ОтветственныеЗаПожарнуюБезопасностьСрезПоследних.Закрыть";
	
	Запрос.УстановитьПараметр("ОтветственныйЗаПожарнуюБезопасность", _Сотрудник);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Помещение");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
